000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыЗапросовДоступностиТоваровШапка/СтатусыЗапросовДоступностиТоваровШапка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗапросовДоступностиТоваровШапка</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Удалён</name>
  </enumValues>
  <enumValues>
    <name>КОтправке</name>
  </enumValues>
  <enumValues>
    <name>Отменён</name>
  </enumValues>
  <enumValues>
    <name>Изменён</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Сборка</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаКассе</name>
  </enumValues>
  <enumValues>
    <name>ПродажаБезнал</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноСогласован</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитьОтмену</name>
  </enumValues>
  <enumValues>
    <name>Выдан</name>
  </enumValues>
  <enumValues>
    <name>ЧекВКЦ</name>
  </enumValues>
  <enumValues>
    <name>ВыданДоставке</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/ЗаказыПокупателейКлиент/Module.bsl
#Область ФункционалЗапросДоступностиТоваров

Процедура КомандаИзменитьСтатусДокумента(ДокументСсылка, Форма, КлючФормы)	Экспорт  
	
	Если КлючФормы = "ФормаДокумента" Тогда
		
		Попытка
			ПрошлыйСтатус = Форма.Объект.СтатусЗапроса;
			ДанныеСостояния = ЗаказыПокупателейСервер.ПолучитьСледующийСтатусЗапросаДоступностиТоваров(Форма.Объект.Ссылка); 
			Форма.Объект.СтатусЗапроса = ДанныеСостояния;
			Форма.Модифицированность = Истина;
			Форма.Записать();
		Исключение
			Форма.Объект.СтатусЗапроса = ПрошлыйСтатус;
		КонецПопытки;
		Оповестить("ИзменилСледующийСтатусЗапроса");
		
	Иначе
		
		ДанныеСостояния = ЗаказыПокупателейСервер.ПолучитьСледующийСтатусЗапросаДоступностиТоваров(ДокументСсылка); 
		ЗаказыПокупателейСервер.УстановитьСостояниеЗапросаДоступностиТоваров(ДокументСсылка, ДанныеСостояния);
		
	КонецЕсли; 
	
	ОформитьКнопкуИзменениеСтатусаДокумента(ДокументСсылка, Форма, КлючФормы); 
	Оповестить("ЗаписанЗапросДоступностиТоваров");

КонецПроцедуры

Процедура ОформитьКнопкуИзменениеСтатусаДокумента(ДокументСсылка, Форма, КлючФормы)	Экспорт

	//Кнопка = Форма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаДокументЗапросДоступностиТоваровИзменениеСтатусаДокумента;
	Если Форма.Элементы.Найти("ФормаДокументЗапросДоступностиТоваровИзменениеСтатусаДокумента") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Кнопка = Форма.Элементы.ФормаДокументЗапросДоступностиТоваровИзменениеСтатусаДокумента;
	Кнопка.Видимость = Истина;

	Если ДокументСсылка = Неопределено
		Или Не ЗаказыПокупателейСервер.ДоступностьДляРедактирования(ДокументСсылка) Тогда

		Кнопка.Заголовок = "Нет действий";
		Кнопка.Доступность = Ложь;

	Иначе
		
		ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента();

		ЗапросДанногоМагазина = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "МагазинОтправитель")
				 = ПараметрыРаботыКлиента.ТекущийМагазин);

		ИсключительныйРежим = ТехническаяПоддержкаВызовСервера.ИсключительныйРежим();
	
		Если КлючФормы = "ФормаСписка" Тогда
			
			СледующееСостояние = ЗаказыПокупателейСервер.ПолучитьСледующийСтатусЗапросаДоступностиТоваров(ДокументСсылка);
			
		Иначе 
			
			СледующееСостояние = ЗаказыПокупателейСервер.ПолучитьСледующийСтатусЗапросаДоступностиТоваров(Форма.Объект.Ссылка);
			
		КонецЕсли;
		
		Кнопка.Доступность = Истина; 
		
		Если СледующееСостояние = ПредопределенноеЗначение("Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ВРаботе")
				И (ЗапросДанногоМагазина Или ИсключительныйРежим) Тогда 
			
			Кнопка.Заголовок = "Взять документ в работу";
			
		ИначеЕсли СледующееСостояние = ПредопределенноеЗначение("Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Отменён")
				И (ЗапросДанногоМагазина Или ИсключительныйРежим) Тогда
					
			Кнопка.Заголовок = "Подтвердить отмену";
			
		ИначеЕсли СледующееСостояние = ПредопределенноеЗначение("Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Согласован")
				И (ЗапросДанногоМагазина Или ИсключительныйРежим) Тогда
					
			Кнопка.Заголовок = "Согласовать документ";
			
		ИначеЕсли СледующееСостояние = ПредопределенноеЗначение("Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ПустаяСсылка") Тогда 
			
			Кнопка.Заголовок = "Нет действий";
			Кнопка.Доступность = Ложь;
			
		ИначеЕсли СледующееСостояние = ПредопределенноеЗначение("Перечисление.СтатусыЗапросовДоступностиТоваровШапка.КОтправке")
				И (ЗапросДанногоМагазина Или ИсключительныйРежим) Тогда
					
			Кнопка.Заголовок = "Заказ собран";
			
		ИначеЕсли СледующееСостояние = ПредопределенноеЗначение("Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Получен") Тогда
					
			Кнопка.Заголовок = "Подтвердить получение";
			
		ИначеЕсли СледующееСостояние = ПредопределенноеЗначение("Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Выдан") Тогда 
			
			Кнопка.Заголовок = "Выдать заказ";
			
		ИначеЕсли СледующееСостояние = ПредопределенноеЗначение("Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ВыданДоставке") Тогда 
			
			Кнопка.Заголовок = "Выдать на доставку";
			
		Иначе

			Кнопка.Заголовок = "Нет действий";
			Кнопка.Доступность = Ложь;
			
		КонецЕсли;

	КонецЕсли;
	
	Если ОбменДаннымиПовтИсп.ЭтоГлавныйУзел()
			И Не ТехническаяПоддержкаВызовСервера.ИсключительныйРежим() Тогда
		Кнопка.Доступность = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура ОформитьКнопкуСозданиеНаОснованииПеремещения(Форма)	Экспорт

	//Кнопка = Форма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаДокументЗапросДоступностиТоваровИзменениеСтатусаДокумента;
	Если Форма.Элементы.Найти("ФормаДокументПеремещениеТоваровСоздатьНаОсновании") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Кнопка = Форма.Элементы.ФормаДокументПеремещениеТоваровСоздатьНаОсновании;
	
	ИсключительныйРежим = ТехническаяПоддержкаВызовСервера.ИсключительныйРежим();

	Кнопка.Доступность = ИсключительныйРежим;
	Кнопка.Видимость = ИсключительныйРежим;

КонецПроцедуры

Процедура ОформитьКнопкуСозданиеНаОснованииЭлектроннойНакладной(Форма)	Экспорт

	//Кнопка = Форма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаДокументЗапросДоступностиТоваровИзменениеСтатусаДокумента;
	Если Форма.Элементы.Найти("ФормаДокументЭлектроннаяНакладнаяСоздатьНаОсновании") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Кнопка = Форма.Элементы.ФормаДокументЭлектроннаяНакладнаяСоздатьНаОсновании;

	ЭННаОсновании = (Форма.Объект.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусыЗапросовДоступностиТоваровШапка.КОтправке"))
		И (Форма.НомерТТН = ПредопределенноеЗначение("Документ.ЭлектроннаяНакладная.ПустаяСсылка"));
	ИсключительныйРежим = ТехническаяПоддержкаВызовСервера.ИсключительныйРежим();

	Кнопка.Доступность = ЭННаОсновании Или ИсключительныйРежим;
	Кнопка.Видимость = ЭННаОсновании Или ИсключительныйРежим;

КонецПроцедуры

#КонецОбласти
